<abi-corpus version='2.1' architecture='elf-powerpc' soname='librtasevent.so.2'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- add_re_scn -->
    <elf-symbol name='add_re_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- cleanup_rtas_event -->
    <elf-symbol name='cleanup_rtas_event' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- get_re_scn -->
    <elf-symbol name='get_re_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- parse_cpu_scn -->
    <elf-symbol name='parse_cpu_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- parse_dump_scn -->
    <elf-symbol name='parse_dump_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- parse_epow_scn -->
    <elf-symbol name='parse_epow_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- parse_fru_scn -->
    <elf-symbol name='parse_fru_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- parse_generic_v6_scn -->
    <elf-symbol name='parse_generic_v6_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- parse_hotplug_scn -->

    <elf-symbol name='print_scn_title' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- print_src_refcode -->
    <elf-symbol name='print_src_refcode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- print_usr_hdr_action -->
    <elf-symbol name='print_usr_hdr_action' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- print_usr_hdr_event_data -->
    <elf-symbol name='print_usr_hdr_event_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- print_usr_hdr_subsystem_id -->
    <elf-symbol name='print_usr_hdr_subsystem_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- print_v6_hdr -->
    <elf-symbol name='print_v6_hdr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- re_scn_id -->
    <elf-symbol name='re_scn_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_copy -->
    <elf-symbol name='rtas_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_cpu_scn -->
    <elf-symbol name='rtas_get_cpu_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_dump_scn -->
    <elf-symbol name='rtas_get_dump_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_epow_scn -->
    <elf-symbol name='rtas_get_epow_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_event_exthdr_scn -->
    <elf-symbol name='rtas_get_event_exthdr_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_event_hdr_scn -->
    <elf-symbol name='rtas_get_event_hdr_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_hotplug_scn -->
    <elf-symbol name='rtas_get_hotplug_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_ibm_diag_scn -->
    <elf-symbol name='rtas_get_ibm_diag_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_ibm_sp_scn -->
    <elf-symbol name='rtas_get_ibm_sp_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_io_scn -->
    <elf-symbol name='rtas_get_io_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_lri_scn -->
    <elf-symbol name='rtas_get_lri_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_mem_scn -->
    <elf-symbol name='rtas_get_mem_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_mt_scn -->
    <elf-symbol name='rtas_get_mt_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_post_scn -->
    <elf-symbol name='rtas_get_post_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_priv_hdr_scn -->
    <elf-symbol name='rtas_get_priv_hdr_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_src_scn -->
    <elf-symbol name='rtas_get_src_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_usr_hdr_scn -->
    <elf-symbol name='rtas_get_usr_hdr_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_get_vend_errlog_scn -->
    <elf-symbol name='rtas_get_vend_errlog_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_print -->
    <elf-symbol name='rtas_print' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_print_event -->
    <elf-symbol name='rtas_print_event' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_print_raw_event -->
    <elf-symbol name='rtas_print_raw_event' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_print_scn -->
    <elf-symbol name='rtas_print_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rtas_set_print_width -->
    <elf-symbol name='rtas_set_print_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- update_os_id_scn -->
    <elf-symbol name='update_os_id_scn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- rtas_entity_names -->
    <elf-symbol name='rtas_entity_names' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='32' path='librtasevent_src/get_rtas_event.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <!-- char[2] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='16' id='49f79167'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <!-- struct rtas_event -->
    <class-decl name='rtas_event' size-in-bits='192' is-struct='yes' visibility='default' id='b0fbd6b0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int rtas_event::version -->
        <var-decl name='version' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int rtas_event::event_no -->
        <var-decl name='event_no' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char* rtas_event::buffer -->
        <var-decl name='buffer' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t rtas_event::offset -->
        <var-decl name='offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_event::event_length -->
        <var-decl name='event_length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- scn_header* rtas_event::event_scns -->
        <var-decl name='event_scns' type-id='32e15bc5' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_v6_hdr_raw -->
    <class-decl name='rtas_v6_hdr_raw' size-in-bits='64' is-struct='yes' visibility='default' id='c554f330'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char rtas_v6_hdr_raw::id[2] -->
        <var-decl name='id' type-id='49f79167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- uint32_t rtas_v6_hdr_raw::length -->
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t rtas_v6_hdr_raw::version -->
        <var-decl name='version' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <!-- uint32_t rtas_v6_hdr_raw::subtype -->
        <var-decl name='subtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <!-- uint32_t rtas_v6_hdr_raw::creator_comp_id -->
        <var-decl name='creator_comp_id' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct scn_header -->
    <class-decl name='scn_header' size-in-bits='128' is-struct='yes' visibility='default' id='2fb651a5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header* scn_header::next -->
        <var-decl name='next' type-id='32e15bc5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- rtas_event* scn_header::re -->
        <var-decl name='re' type-id='699f2166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t scn_header::raw_offset -->
        <var-decl name='raw_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int scn_header::scn_id -->
        <var-decl name='scn_id' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- typedef unsigned int __uint32_t -->
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <!-- typedef __uint32_t uint32_t -->
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <!-- char* -->
    <pointer-type-def type-id='a84c031d' size-in-bits='32' id='26a90f95'/>
    <!-- rtas_event* -->
    <pointer-type-def type-id='b0fbd6b0' size-in-bits='32' id='699f2166'/>
    <!-- rtas_v6_hdr_raw* -->
    <pointer-type-def type-id='c554f330' size-in-bits='32' id='0356b156'/>
    <!-- scn_header* -->
    <pointer-type-def type-id='2fb651a5' size-in-bits='32' id='32e15bc5'/>
    <!-- void* -->
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <!-- void -->
    <type-decl name='void' id='48b5725f'/>
    <!-- void rtas_copy(void*, rtas_event*, uint32_t) -->
    <function-decl name='rtas_copy' mangled-name='rtas_copy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_copy'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='to'/>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- parameter of type 'typedef uint32_t' -->
      <parameter type-id='8f92235e' name='size'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- int cleanup_rtas_event(rtas_event*) -->
    <function-decl name='cleanup_rtas_event' mangled-name='cleanup_rtas_event' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='cleanup_rtas_event'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void add_re_scn(rtas_event*, void*, int) -->
    <function-decl name='add_re_scn' mangled-name='add_re_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='add_re_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='scn'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='scn_id'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- int re_scn_id(rtas_v6_hdr_raw*) -->
    <function-decl name='re_scn_id' mangled-name='re_scn_id' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='re_scn_id'>
      <!-- parameter of type 'rtas_v6_hdr_raw*' -->
      <parameter type-id='0356b156' name='v6hdr'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- scn_header* get_re_scn(rtas_event*, int) -->
    <function-decl name='get_re_scn' mangled-name='get_re_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='get_re_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='scn_id'/>
      <!-- scn_header* -->
      <return type-id='32e15bc5'/>
    </function-decl>
    <!-- rtas_event* parse_v6_rtas_event(rtas_event*) -->
    <function-decl name='parse_v6_rtas_event' mangled-name='parse_v6_rtas_event' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_v6_rtas_event'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_event* -->
      <return type-id='699f2166'/>
    </function-decl>
    <!-- rtas_event* parse_rtas_event(char*, int) -->
    <function-decl name='parse_rtas_event' mangled-name='parse_rtas_event' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_rtas_event'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95' name='buf'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='buflen'/>
      <!-- rtas_event* -->
      <return type-id='699f2166'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/print_rtas_event.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char*[16] -->
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='512' id='04959838'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <!-- struct rtas_date -->
    <class-decl name='rtas_date' size-in-bits='96' is-struct='yes' visibility='default' id='74d9bf5c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t rtas_date::year -->
        <var-decl name='year' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t rtas_date::month -->
        <var-decl name='month' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t rtas_date::day -->
        <var-decl name='day' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_event_exthdr -->
    <class-decl name='rtas_event_exthdr' size-in-bits='960' is-struct='yes' visibility='default' id='1b7500fe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_event_exthdr::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_event_exthdr::valid -->
        <var-decl name='valid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t rtas_event_exthdr::unrecoverable -->
        <var-decl name='unrecoverable' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t rtas_event_exthdr::recoverable -->
        <var-decl name='recoverable' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t rtas_event_exthdr::unrecoverable_bypassed -->
        <var-decl name='unrecoverable_bypassed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t rtas_event_exthdr::predictive -->
        <var-decl name='predictive' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_event_exthdr::newlog -->
        <var-decl name='newlog' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint32_t rtas_event_exthdr::bigendian -->
        <var-decl name='bigendian' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- uint32_t rtas_event_exthdr::platform_specific -->
        <var-decl name='platform_specific' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint32_t rtas_event_exthdr::platform_value -->
        <var-decl name='platform_value' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- uint32_t rtas_event_exthdr::power_pc -->
        <var-decl name='power_pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- uint32_t rtas_event_exthdr::addr_invalid -->
        <var-decl name='addr_invalid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- uint32_t rtas_event_exthdr::format_type -->
        <var-decl name='format_type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- uint32_t rtas_event_exthdr::non_hardware -->
        <var-decl name='non_hardware' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- uint32_t rtas_event_exthdr::hot_plug -->
        <var-decl name='hot_plug' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- uint32_t rtas_event_exthdr::group_failure -->
        <var-decl name='group_failure' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- uint32_t rtas_event_exthdr::residual -->
        <var-decl name='residual' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- uint32_t rtas_event_exthdr::boot -->
        <var-decl name='boot' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- uint32_t rtas_event_exthdr::config_change -->
        <var-decl name='config_change' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- uint32_t rtas_event_exthdr::post -->
        <var-decl name='post' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <!-- rtas_time rtas_event_exthdr::time -->
        <var-decl name='time' type-id='595fd2c1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <!-- rtas_date rtas_event_exthdr::date -->
        <var-decl name='date' type-id='74d9bf5c' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_event_hdr -->
    <class-decl name='rtas_event_hdr' size-in-bits='384' is-struct='yes' visibility='default' id='faf9cb79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_event_hdr::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_event_hdr::version -->
        <var-decl name='version' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t rtas_event_hdr::severity -->
        <var-decl name='severity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t rtas_event_hdr::disposition -->
        <var-decl name='disposition' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t rtas_event_hdr::extended -->
        <var-decl name='extended' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t rtas_event_hdr::initiator -->
        <var-decl name='initiator' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_event_hdr::target -->
        <var-decl name='target' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint32_t rtas_event_hdr::type -->
        <var-decl name='type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- uint32_t rtas_event_hdr::ext_log_length -->
        <var-decl name='ext_log_length' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_time -->
    <class-decl name='rtas_time' size-in-bits='128' is-struct='yes' visibility='default' id='595fd2c1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t rtas_time::hour -->
        <var-decl name='hour' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t rtas_time::minutes -->
        <var-decl name='minutes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t rtas_time::seconds -->
        <var-decl name='seconds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t rtas_time::hundredths -->
        <var-decl name='hundredths' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- typedef _IO_FILE FILE -->
    <typedef-decl name='FILE' type-id='ec1ed955' id='aa12d1ba'/>
    <!-- FILE* -->
    <pointer-type-def type-id='aa12d1ba' size-in-bits='32' id='822cd80b'/>
    <!-- rtas_event_exthdr* -->
    <pointer-type-def type-id='1b7500fe' size-in-bits='32' id='9ad2fb54'/>
    <!-- rtas_event_hdr* -->
    <pointer-type-def type-id='faf9cb79' size-in-bits='32' id='9174b7c1'/>
    <!-- variadic parameter type -->
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <!-- struct _IO_FILE -->
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='ec1ed955'/>
    <!-- char* rtas_entity_names[16] -->
    <var-decl name='rtas_entity_names' type-id='04959838' mangled-name='rtas_entity_names' visibility='default' elf-symbol-id='rtas_entity_names'/>
    <!-- int print_scn_title(char*, ...) -->
    <function-decl name='print_scn_title' mangled-name='print_scn_title' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_scn_title'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95' name='fmt'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int print_raw_data(char*, int) -->
    <function-decl name='print_raw_data' mangled-name='print_raw_data' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_raw_data'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95' name='data'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='data_len'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int rtas_print_raw_event(FILE*, rtas_event*) -->
    <function-decl name='rtas_print_raw_event' mangled-name='rtas_print_raw_event' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_print_raw_event'>
      <!-- parameter of type 'FILE*' -->
      <parameter type-id='822cd80b' name='stream'/>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int rtas_set_print_width(int) -->
    <function-decl name='rtas_set_print_width' mangled-name='rtas_set_print_width' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_set_print_width'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='width'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int rtas_print(char*, ...) -->
    <function-decl name='rtas_print' mangled-name='rtas_print' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_print'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95' name='fmt'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int rtas_print_scn(FILE*, scn_header*, int) -->
    <function-decl name='rtas_print_scn' mangled-name='rtas_print_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_print_scn'>
      <!-- parameter of type 'FILE*' -->
      <parameter type-id='822cd80b' name='stream'/>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int rtas_print_event(FILE*, rtas_event*, int) -->
    <function-decl name='rtas_print_event' mangled-name='rtas_print_event' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_print_event'>
      <!-- parameter of type 'FILE*' -->
      <parameter type-id='822cd80b' name='stream'/>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_event_hdr* rtas_get_event_hdr_scn(rtas_event*) -->
    <function-decl name='rtas_get_event_hdr_scn' mangled-name='rtas_get_event_hdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_event_hdr_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_event_hdr* -->
      <return type-id='9174b7c1'/>
    </function-decl>
    <!-- int print_re_hdr_scn(scn_header*, int) -->
    <function-decl name='print_re_hdr_scn' mangled-name='print_re_hdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_hdr_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_event_exthdr* rtas_get_event_exthdr_scn(rtas_event*) -->
    <function-decl name='rtas_get_event_exthdr_scn' mangled-name='rtas_get_event_exthdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_event_exthdr_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_event_exthdr* -->
      <return type-id='9ad2fb54'/>
    </function-decl>
    <!-- int print_re_exthdr_scn(scn_header*, int) -->
    <function-decl name='print_re_exthdr_scn' mangled-name='print_re_exthdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_exthdr_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_cpu.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- struct rtas_cpu_scn -->
    <class-decl name='rtas_cpu_scn' size-in-bits='352' is-struct='yes' visibility='default' id='f0a69f29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_cpu_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_cpu_scn::internal -->
        <var-decl name='internal' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <!-- uint32_t rtas_cpu_scn::intcache -->
        <var-decl name='intcache' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130'>
        <!-- uint32_t rtas_cpu_scn::extcache_parity -->
        <var-decl name='extcache_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131'>
        <!-- uint32_t rtas_cpu_scn::extcache_ecc -->
        <var-decl name='extcache_ecc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132'>
        <!-- uint32_t rtas_cpu_scn::sysbus_timeout -->
        <var-decl name='sysbus_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133'>
        <!-- uint32_t rtas_cpu_scn::io_timeout -->
        <var-decl name='io_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='134'>
        <!-- uint32_t rtas_cpu_scn::sysbus_parity -->
        <var-decl name='sysbus_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='135'>
        <!-- uint32_t rtas_cpu_scn::sysbus_protocol -->
        <var-decl name='sysbus_protocol' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <!-- uint32_t rtas_cpu_scn::id -->
        <var-decl name='id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <!-- uint32_t rtas_cpu_scn::element -->
        <var-decl name='element' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t rtas_cpu_scn::failing_address_hi -->
        <var-decl name='failing_address_hi' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t rtas_cpu_scn::failing_address_lo -->
        <var-decl name='failing_address_lo' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t rtas_cpu_scn::try_reboot -->
        <var-decl name='try_reboot' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- rtas_cpu_scn* -->
    <pointer-type-def type-id='f0a69f29' size-in-bits='32' id='0e727441'/>
    <!-- int parse_cpu_scn(rtas_event*) -->
    <function-decl name='parse_cpu_scn' mangled-name='parse_cpu_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_cpu_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_cpu_scn* rtas_get_cpu_scn(rtas_event*) -->
    <function-decl name='rtas_get_cpu_scn' mangled-name='rtas_get_cpu_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_cpu_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_cpu_scn* -->
      <return type-id='0e727441'/>
    </function-decl>
    <!-- int print_re_cpu_scn(scn_header*, int) -->
    <function-decl name='print_re_cpu_scn' mangled-name='print_re_cpu_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_cpu_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_dump.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <!-- struct rtas_dump_scn -->
    <class-decl name='rtas_dump_scn' size-in-bits='832' is-struct='yes' visibility='default' id='3c700765'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_dump_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- rtas_v6_hdr rtas_dump_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='82350f5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_dump_scn::id -->
        <var-decl name='id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint32_t rtas_dump_scn::location -->
        <var-decl name='location' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- uint32_t rtas_dump_scn::fname_type -->
        <var-decl name='fname_type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint32_t rtas_dump_scn::size_valid -->
        <var-decl name='size_valid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- uint32_t rtas_dump_scn::id_len -->
        <var-decl name='id_len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- uint32_t rtas_dump_scn::size_hi -->
        <var-decl name='size_hi' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- uint32_t rtas_dump_scn::size_lo -->
        <var-decl name='size_lo' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- char rtas_dump_scn::os_id[40] -->
        <var-decl name='os_id' type-id='36c46961' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_v6_hdr -->
    <class-decl name='rtas_v6_hdr' size-in-bits='160' is-struct='yes' visibility='default' id='82350f5d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char rtas_v6_hdr::id[2] -->
        <var-decl name='id' type-id='49f79167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t rtas_v6_hdr::length -->
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t rtas_v6_hdr::version -->
        <var-decl name='version' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t rtas_v6_hdr::subtype -->
        <var-decl name='subtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_v6_hdr::creator_comp_id -->
        <var-decl name='creator_comp_id' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- const char -->
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <!-- const char* -->
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <!-- rtas_dump_scn* -->
    <pointer-type-def type-id='3c700765' size-in-bits='32' id='8aeb67a5'/>
    <!-- int parse_dump_scn(rtas_event*) -->
    <function-decl name='parse_dump_scn' mangled-name='parse_dump_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_dump_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_dump_scn* rtas_get_dump_scn(rtas_event*) -->
    <function-decl name='rtas_get_dump_scn' mangled-name='rtas_get_dump_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_dump_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_dump_scn* -->
      <return type-id='8aeb67a5'/>
    </function-decl>
    <!-- int update_os_id_scn(rtas_event*, const char*) -->
    <function-decl name='update_os_id_scn' mangled-name='update_os_id_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='update_os_id_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='id'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int print_re_dump_scn(scn_header*, int) -->
    <function-decl name='print_re_dump_scn' mangled-name='print_re_dump_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_dump_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_epow.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char[8] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' id='8e100159'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <!-- struct rtas_epow_scn -->
    <class-decl name='rtas_epow_scn' size-in-bits='608' is-struct='yes' visibility='default' id='27af587c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_epow_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_epow_scn::sensor_value -->
        <var-decl name='sensor_value' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='156'>
        <!-- uint32_t rtas_epow_scn::action_code -->
        <var-decl name='action_code' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t rtas_epow_scn::sensor -->
        <var-decl name='sensor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='161'>
        <!-- uint32_t rtas_epow_scn::power_fault -->
        <var-decl name='power_fault' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='162'>
        <!-- uint32_t rtas_epow_scn::fan -->
        <var-decl name='fan' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='163'>
        <!-- uint32_t rtas_epow_scn::temp -->
        <var-decl name='temp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='164'>
        <!-- uint32_t rtas_epow_scn::redundancy -->
        <var-decl name='redundancy' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='165'>
        <!-- uint32_t rtas_epow_scn::CUoD -->
        <var-decl name='CUoD' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <!-- uint32_t rtas_epow_scn::general -->
        <var-decl name='general' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169'>
        <!-- uint32_t rtas_epow_scn::power_loss -->
        <var-decl name='power_loss' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='170'>
        <!-- uint32_t rtas_epow_scn::power_supply -->
        <var-decl name='power_supply' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='171'>
        <!-- uint32_t rtas_epow_scn::power_switch -->
        <var-decl name='power_switch' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='172'>
        <!-- uint32_t rtas_epow_scn::battery -->
        <var-decl name='battery' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t rtas_epow_scn::sensor_token -->
        <var-decl name='sensor_token' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t rtas_epow_scn::sensor_index -->
        <var-decl name='sensor_index' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t rtas_epow_scn::sensor_value2 -->
        <var-decl name='sensor_value2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_epow_scn::sensor_status -->
        <var-decl name='sensor_status' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- rtas_v6_hdr rtas_epow_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='82350f5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- uint32_t rtas_epow_scn::event_modifier -->
        <var-decl name='event_modifier' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- char rtas_epow_scn::reason_code[8] -->
        <var-decl name='reason_code' type-id='8e100159' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- rtas_epow_scn* -->
    <pointer-type-def type-id='27af587c' size-in-bits='32' id='493ba5aa'/>
    <!-- int parse_epow_scn(rtas_event*) -->
    <function-decl name='parse_epow_scn' mangled-name='parse_epow_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_epow_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_epow_scn* rtas_get_epow_scn(rtas_event*) -->
    <function-decl name='rtas_get_epow_scn' mangled-name='rtas_get_epow_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_epow_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_epow_scn* -->
      <return type-id='493ba5aa'/>
    </function-decl>
    <!-- int print_re_epow_scn(scn_header*, int) -->
    <function-decl name='print_re_epow_scn' mangled-name='print_re_epow_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_epow_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_hotplug.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char[1] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <!-- struct rtas_hotplug_scn -->
    <class-decl name='rtas_hotplug_scn' size-in-bits='352' is-struct='yes' visibility='default' id='1915b124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_hotplug_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- rtas_v6_hdr rtas_hotplug_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='82350f5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_hotplug_scn::type -->
        <var-decl name='type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <!-- uint32_t rtas_hotplug_scn::action -->
        <var-decl name='action' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <!-- uint32_t rtas_hotplug_scn::identifier -->
        <var-decl name='identifier' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='312'>
        <!-- uint32_t rtas_hotplug_scn::reserved -->
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- union {uint32_t drc_index; uint32_t count; char drc_name[1];} rtas_hotplug_scn::u1 -->
        <var-decl name='u1' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- union {uint32_t drc_index; uint32_t count; char drc_name[1];} -->
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <!-- uint32_t drc_index -->
        <var-decl name='drc_index' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <!-- uint32_t count -->
        <var-decl name='count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <!-- char drc_name[1] -->
        <var-decl name='drc_name' type-id='89feb1ec' visibility='default'/>
      </data-member>
    </union-decl>
    <!-- rtas_hotplug_scn* -->
    <pointer-type-def type-id='1915b124' size-in-bits='32' id='1ef3b582'/>
    <!-- int parse_hotplug_scn(rtas_event*) -->
    <function-decl name='parse_hotplug_scn' mangled-name='parse_hotplug_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_hotplug_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_hotplug_scn* rtas_get_hotplug_scn(rtas_event*) -->
    <function-decl name='rtas_get_hotplug_scn' mangled-name='rtas_get_hotplug_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_hotplug_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_hotplug_scn* -->
      <return type-id='1ef3b582'/>
    </function-decl>
    <!-- int print_re_hotplug_scn(scn_header*, int) -->
    <function-decl name='print_re_hotplug_scn' mangled-name='print_re_hotplug_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_hotplug_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_io.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char[216] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1728' id='1ddaa016'>
      <!-- <anonymous range>[216] -->
      <subrange length='216' type-id='f0981eeb' id='83ad04be'/>
    </array-type-def>
    <!-- struct rtas_io_scn -->
    <class-decl name='rtas_io_scn' size-in-bits='2432' is-struct='yes' visibility='default' id='4510b6c3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_io_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_io_scn::bus_addr_parity -->
        <var-decl name='bus_addr_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <!-- uint32_t rtas_io_scn::bus_data_parity -->
        <var-decl name='bus_data_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130'>
        <!-- uint32_t rtas_io_scn::bus_timeout -->
        <var-decl name='bus_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131'>
        <!-- uint32_t rtas_io_scn::bridge_internal -->
        <var-decl name='bridge_internal' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132'>
        <!-- uint32_t rtas_io_scn::non_pci -->
        <var-decl name='non_pci' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133'>
        <!-- uint32_t rtas_io_scn::mezzanine_addr_parity -->
        <var-decl name='mezzanine_addr_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='134'>
        <!-- uint32_t rtas_io_scn::mezzanine_data_parity -->
        <var-decl name='mezzanine_data_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='135'>
        <!-- uint32_t rtas_io_scn::mezzanine_timeout -->
        <var-decl name='mezzanine_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <!-- uint32_t rtas_io_scn::bridge_via_sysbus -->
        <var-decl name='bridge_via_sysbus' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='137'>
        <!-- uint32_t rtas_io_scn::bridge_via_mezzanine -->
        <var-decl name='bridge_via_mezzanine' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='138'>
        <!-- uint32_t rtas_io_scn::bridge_via_expbus -->
        <var-decl name='bridge_via_expbus' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='139'>
        <!-- uint32_t rtas_io_scn::detected_by_expbus -->
        <var-decl name='detected_by_expbus' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140'>
        <!-- uint32_t rtas_io_scn::expbus_data_parity -->
        <var-decl name='expbus_data_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='141'>
        <!-- uint32_t rtas_io_scn::expbus_timeout -->
        <var-decl name='expbus_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='142'>
        <!-- uint32_t rtas_io_scn::expbus_connection_failure -->
        <var-decl name='expbus_connection_failure' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='143'>
        <!-- uint32_t rtas_io_scn::expbus_not_operating -->
        <var-decl name='expbus_not_operating' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <!-- uint32_t rtas_io_scn::pci_sig_bus_id -->
        <var-decl name='pci_sig_bus_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <!-- uint32_t rtas_io_scn::pci_sig_busno -->
        <var-decl name='pci_sig_busno' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t rtas_io_scn::pci_sig_devfn -->
        <var-decl name='pci_sig_devfn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <!-- uint32_t rtas_io_scn::pci_sig_deviceid -->
        <var-decl name='pci_sig_deviceid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t rtas_io_scn::pci_sig_vendorid -->
        <var-decl name='pci_sig_vendorid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <!-- uint32_t rtas_io_scn::pci_sig_revisionid -->
        <var-decl name='pci_sig_revisionid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <!-- uint32_t rtas_io_scn::pci_sig_slot -->
        <var-decl name='pci_sig_slot' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t rtas_io_scn::pci_send_bus_id -->
        <var-decl name='pci_send_bus_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <!-- uint32_t rtas_io_scn::pci_send_busno -->
        <var-decl name='pci_send_busno' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <!-- uint32_t rtas_io_scn::pci_send_devfn -->
        <var-decl name='pci_send_devfn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t rtas_io_scn::pci_send_deviceid -->
        <var-decl name='pci_send_deviceid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <!-- uint32_t rtas_io_scn::pci_send_vendorid -->
        <var-decl name='pci_send_vendorid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_io_scn::pci_send_revisionid -->
        <var-decl name='pci_send_revisionid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <!-- uint32_t rtas_io_scn::pci_send_slot -->
        <var-decl name='pci_send_slot' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- rtas_v6_hdr rtas_io_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='82350f5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- uint32_t rtas_io_scn::event_type -->
        <var-decl name='event_type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- uint32_t rtas_io_scn::rpc_length -->
        <var-decl name='rpc_length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- uint32_t rtas_io_scn::scope -->
        <var-decl name='scope' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- uint32_t rtas_io_scn::subtype -->
        <var-decl name='subtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- uint32_t rtas_io_scn::drc_index -->
        <var-decl name='drc_index' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- char rtas_io_scn::rpc_data[216] -->
        <var-decl name='rpc_data' type-id='1ddaa016' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- rtas_io_scn* -->
    <pointer-type-def type-id='4510b6c3' size-in-bits='32' id='b05b0123'/>
    <!-- int parse_io_scn(rtas_event*) -->
    <function-decl name='parse_io_scn' mangled-name='parse_io_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_io_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_io_scn* rtas_get_io_scn(rtas_event*) -->
    <function-decl name='rtas_get_io_scn' mangled-name='rtas_get_io_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_io_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_io_scn* -->
      <return type-id='b05b0123'/>
    </function-decl>
    <!-- int print_re_io_scn(scn_header*, int) -->
    <function-decl name='print_re_io_scn' mangled-name='print_re_io_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_io_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_lri.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- struct rtas_lri_scn -->
    <class-decl name='rtas_lri_scn' size-in-bits='416' is-struct='yes' visibility='default' id='bb3b75ea'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_lri_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- rtas_v6_hdr rtas_lri_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='82350f5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_lri_scn::resource -->
        <var-decl name='resource' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint32_t rtas_lri_scn::capacity -->
        <var-decl name='capacity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- union {uint32_t _lri_cpu_id; uint32_t _lri_drc_index; uint32_t _lri_mem_addr_lo;} rtas_lri_scn::_lri_u1 -->
        <var-decl name='_lri_u1' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint32_t rtas_lri_scn::lri_mem_addr_hi -->
        <var-decl name='lri_mem_addr_hi' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- union {uint32_t _lri_cpu_id; uint32_t _lri_drc_index; uint32_t _lri_mem_addr_lo;} -->
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <!-- uint32_t _lri_cpu_id -->
        <var-decl name='_lri_cpu_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <!-- uint32_t _lri_drc_index -->
        <var-decl name='_lri_drc_index' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <!-- uint32_t _lri_mem_addr_lo -->
        <var-decl name='_lri_mem_addr_lo' type-id='8f92235e' visibility='default'/>
      </data-member>
    </union-decl>
    <!-- rtas_lri_scn* -->
    <pointer-type-def type-id='bb3b75ea' size-in-bits='32' id='1db82228'/>
    <!-- int parse_lri_scn(rtas_event*) -->
    <function-decl name='parse_lri_scn' mangled-name='parse_lri_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_lri_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_lri_scn* rtas_get_lri_scn(rtas_event*) -->
    <function-decl name='rtas_get_lri_scn' mangled-name='rtas_get_lri_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_lri_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_lri_scn* -->
      <return type-id='1db82228'/>
    </function-decl>
    <!-- int print_re_lri_scn(scn_header*, int) -->
    <function-decl name='print_re_lri_scn' mangled-name='print_re_lri_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_lri_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_mem.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- struct rtas_mem_scn -->
    <class-decl name='rtas_mem_scn' size-in-bits='352' is-struct='yes' visibility='default' id='2691803a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_mem_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_mem_scn::uncorrectable -->
        <var-decl name='uncorrectable' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <!-- uint32_t rtas_mem_scn::ECC -->
        <var-decl name='ECC' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130'>
        <!-- uint32_t rtas_mem_scn::threshold_exceeded -->
        <var-decl name='threshold_exceeded' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131'>
        <!-- uint32_t rtas_mem_scn::control_internal -->
        <var-decl name='control_internal' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132'>
        <!-- uint32_t rtas_mem_scn::bad_address -->
        <var-decl name='bad_address' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133'>
        <!-- uint32_t rtas_mem_scn::bad_data -->
        <var-decl name='bad_data' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='134'>
        <!-- uint32_t rtas_mem_scn::bus -->
        <var-decl name='bus' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='135'>
        <!-- uint32_t rtas_mem_scn::timeout -->
        <var-decl name='timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <!-- uint32_t rtas_mem_scn::sysbus_parity -->
        <var-decl name='sysbus_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='137'>
        <!-- uint32_t rtas_mem_scn::sysbus_timeout -->
        <var-decl name='sysbus_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='138'>
        <!-- uint32_t rtas_mem_scn::sysbus_protocol -->
        <var-decl name='sysbus_protocol' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='139'>
        <!-- uint32_t rtas_mem_scn::hostbridge_timeout -->
        <var-decl name='hostbridge_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140'>
        <!-- uint32_t rtas_mem_scn::hostbridge_parity -->
        <var-decl name='hostbridge_parity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='142'>
        <!-- uint32_t rtas_mem_scn::support -->
        <var-decl name='support' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='143'>
        <!-- uint32_t rtas_mem_scn::sysbus_internal -->
        <var-decl name='sysbus_internal' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <!-- uint32_t rtas_mem_scn::controller_detected -->
        <var-decl name='controller_detected' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <!-- uint32_t rtas_mem_scn::controller_faulted -->
        <var-decl name='controller_faulted' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t rtas_mem_scn::failing_address_hi -->
        <var-decl name='failing_address_hi' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t rtas_mem_scn::failing_address_lo -->
        <var-decl name='failing_address_lo' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t rtas_mem_scn::ecc_syndrome -->
        <var-decl name='ecc_syndrome' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <!-- uint32_t rtas_mem_scn::memory_card -->
        <var-decl name='memory_card' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t rtas_mem_scn::sub_elements -->
        <var-decl name='sub_elements' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_mem_scn::element -->
        <var-decl name='element' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- rtas_mem_scn* -->
    <pointer-type-def type-id='2691803a' size-in-bits='32' id='d6ebff98'/>
    <!-- int parse_mem_scn(rtas_event*) -->
    <function-decl name='parse_mem_scn' mangled-name='parse_mem_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_mem_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_mem_scn* rtas_get_mem_scn(rtas_event*) -->
    <function-decl name='rtas_get_mem_scn' mangled-name='rtas_get_mem_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_mem_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_mem_scn* -->
      <return type-id='d6ebff98'/>
    </function-decl>
    <!-- int print_re_mem_scn(scn_header*, int) -->
    <function-decl name='print_re_mem_scn' mangled-name='print_re_mem_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_mem_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_post.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char[13] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='104' id='f01347d9'>
      <!-- <anonymous range>[13] -->
      <subrange length='13' type-id='f0981eeb' id='487fded1'/>
    </array-type-def>
    <!-- struct rtas_post_scn -->
    <class-decl name='rtas_post_scn' size-in-bits='800' is-struct='yes' visibility='default' id='40477d99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_post_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_post_scn::firmware -->
        <var-decl name='firmware' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <!-- uint32_t rtas_post_scn::config -->
        <var-decl name='config' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130'>
        <!-- uint32_t rtas_post_scn::cpu -->
        <var-decl name='cpu' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131'>
        <!-- uint32_t rtas_post_scn::memory -->
        <var-decl name='memory' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132'>
        <!-- uint32_t rtas_post_scn::io -->
        <var-decl name='io' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133'>
        <!-- uint32_t rtas_post_scn::keyboard -->
        <var-decl name='keyboard' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='134'>
        <!-- uint32_t rtas_post_scn::mouse -->
        <var-decl name='mouse' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='135'>
        <!-- uint32_t rtas_post_scn::display -->
        <var-decl name='display' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <!-- uint32_t rtas_post_scn::ipl_floppy -->
        <var-decl name='ipl_floppy' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='137'>
        <!-- uint32_t rtas_post_scn::ipl_controller -->
        <var-decl name='ipl_controller' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='138'>
        <!-- uint32_t rtas_post_scn::ipl_cdrom -->
        <var-decl name='ipl_cdrom' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='139'>
        <!-- uint32_t rtas_post_scn::ipl_disk -->
        <var-decl name='ipl_disk' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140'>
        <!-- uint32_t rtas_post_scn::ipl_net -->
        <var-decl name='ipl_net' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='141'>
        <!-- uint32_t rtas_post_scn::ipl_other -->
        <var-decl name='ipl_other' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='143'>
        <!-- uint32_t rtas_post_scn::firmware_selftest -->
        <var-decl name='firmware_selftest' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <!-- char rtas_post_scn::devname[13] -->
        <var-decl name='devname' type-id='f01347d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- uint32_t rtas_post_scn::err_code[5] -->
        <var-decl name='err_code' type-id='736fb5aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- uint32_t rtas_post_scn::firmware_rev[3] -->
        <var-decl name='firmware_rev' type-id='6f7eb9e8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- uint32_t rtas_post_scn::loc_code[9] -->
        <var-decl name='loc_code' type-id='338d65fe' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- uint32_t[3] -->
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='96' id='6f7eb9e8'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <!-- uint32_t[5] -->
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='160' id='736fb5aa'>
      <!-- <anonymous range>[5] -->
      <subrange length='5' type-id='f0981eeb' id='53010e10'/>
    </array-type-def>
    <!-- uint32_t[9] -->
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='288' id='338d65fe'>
      <!-- <anonymous range>[9] -->
      <subrange length='9' type-id='f0981eeb' id='12e4273c'/>
    </array-type-def>
    <!-- rtas_post_scn* -->
    <pointer-type-def type-id='40477d99' size-in-bits='32' id='e84cc211'/>
    <!-- int parse_post_scn(rtas_event*) -->
    <function-decl name='parse_post_scn' mangled-name='parse_post_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_post_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_post_scn* rtas_get_post_scn(rtas_event*) -->
    <function-decl name='rtas_get_post_scn' mangled-name='rtas_get_post_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_post_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_post_scn* -->
      <return type-id='e84cc211'/>
    </function-decl>
    <!-- int print_re_post_scn(scn_header*, int) -->
    <function-decl name='print_re_post_scn' mangled-name='print_re_post_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_post_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_sp.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char[4] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <!-- struct rtas_ibmsp_scn -->
    <class-decl name='rtas_ibmsp_scn' size-in-bits='352' is-struct='yes' visibility='default' id='21955732'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_ibmsp_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char rtas_ibmsp_scn::ibm[4] -->
        <var-decl name='ibm' type-id='8e0573fd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t rtas_ibmsp_scn::timeout -->
        <var-decl name='timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='161'>
        <!-- uint32_t rtas_ibmsp_scn::i2c_bus -->
        <var-decl name='i2c_bus' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='162'>
        <!-- uint32_t rtas_ibmsp_scn::i2c_secondary_bus -->
        <var-decl name='i2c_secondary_bus' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='163'>
        <!-- uint32_t rtas_ibmsp_scn::memory -->
        <var-decl name='memory' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='164'>
        <!-- uint32_t rtas_ibmsp_scn::registers -->
        <var-decl name='registers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='165'>
        <!-- uint32_t rtas_ibmsp_scn::communication -->
        <var-decl name='communication' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='166'>
        <!-- uint32_t rtas_ibmsp_scn::firmware -->
        <var-decl name='firmware' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='167'>
        <!-- uint32_t rtas_ibmsp_scn::hardware -->
        <var-decl name='hardware' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <!-- uint32_t rtas_ibmsp_scn::vpd_eeprom -->
        <var-decl name='vpd_eeprom' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169'>
        <!-- uint32_t rtas_ibmsp_scn::op_panel -->
        <var-decl name='op_panel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='170'>
        <!-- uint32_t rtas_ibmsp_scn::power_controller -->
        <var-decl name='power_controller' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='171'>
        <!-- uint32_t rtas_ibmsp_scn::fan_sensor -->
        <var-decl name='fan_sensor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='172'>
        <!-- uint32_t rtas_ibmsp_scn::thermal_sensor -->
        <var-decl name='thermal_sensor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='173'>
        <!-- uint32_t rtas_ibmsp_scn::voltage_sensor -->
        <var-decl name='voltage_sensor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <!-- uint32_t rtas_ibmsp_scn::serial_port -->
        <var-decl name='serial_port' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='177'>
        <!-- uint32_t rtas_ibmsp_scn::nvram -->
        <var-decl name='nvram' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='178'>
        <!-- uint32_t rtas_ibmsp_scn::rtc -->
        <var-decl name='rtc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='179'>
        <!-- uint32_t rtas_ibmsp_scn::jtag -->
        <var-decl name='jtag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='180'>
        <!-- uint32_t rtas_ibmsp_scn::tod_battery -->
        <var-decl name='tod_battery' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='182'>
        <!-- uint32_t rtas_ibmsp_scn::heartbeat -->
        <var-decl name='heartbeat' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='183'>
        <!-- uint32_t rtas_ibmsp_scn::surveillance -->
        <var-decl name='surveillance' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <!-- uint32_t rtas_ibmsp_scn::pcn_connection -->
        <var-decl name='pcn_connection' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='185'>
        <!-- uint32_t rtas_ibmsp_scn::pcn_node -->
        <var-decl name='pcn_node' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='188'>
        <!-- uint32_t rtas_ibmsp_scn::pcn_access -->
        <var-decl name='pcn_access' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uint32_t rtas_ibmsp_scn::sensor_token -->
        <var-decl name='sensor_token' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- uint32_t rtas_ibmsp_scn::sensor_index -->
        <var-decl name='sensor_index' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- rtas_ibmsp_scn* -->
    <pointer-type-def type-id='21955732' size-in-bits='32' id='952fe410'/>
    <!-- int parse_sp_scn(rtas_event*) -->
    <function-decl name='parse_sp_scn' mangled-name='parse_sp_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_sp_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_ibmsp_scn* rtas_get_ibm_sp_scn(rtas_event*) -->
    <function-decl name='rtas_get_ibm_sp_scn' mangled-name='rtas_get_ibm_sp_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_ibm_sp_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_ibmsp_scn* -->
      <return type-id='952fe410'/>
    </function-decl>
    <!-- int print_re_ibmsp_scn(scn_header*, int) -->
    <function-decl name='print_re_ibmsp_scn' mangled-name='print_re_ibmsp_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_ibmsp_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_srcfru.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char[36] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='288' id='16e6f2c6'>
      <!-- <anonymous range>[36] -->
      <subrange length='36' type-id='f0981eeb' id='ae666bde'/>
    </array-type-def>
    <!-- char[7] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='56' id='4e02d0a6'>
      <!-- <anonymous range>[7] -->
      <subrange length='7' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <!-- char[80] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='640' id='aa5ff375'>
      <!-- <anonymous range>[80] -->
      <subrange length='80' type-id='f0981eeb' id='b4129fbd'/>
    </array-type-def>
    <!-- struct rtas_fru_hdr -->
    <class-decl name='rtas_fru_hdr' size-in-bits='128' is-struct='yes' visibility='default' id='f4fe811a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- rtas_fru_hdr* rtas_fru_hdr::next -->
        <var-decl name='next' type-id='543d4fd8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char rtas_fru_hdr::id[2] -->
        <var-decl name='id' type-id='49f79167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t rtas_fru_hdr::length -->
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t rtas_fru_hdr::flags -->
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_fru_scn -->
    <class-decl name='rtas_fru_scn' size-in-bits='896' is-struct='yes' visibility='default' id='554c4658'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t rtas_fru_scn::length -->
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t rtas_fru_scn::type -->
        <var-decl name='type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t rtas_fru_scn::fru_id_included -->
        <var-decl name='fru_id_included' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- uint32_t rtas_fru_scn::fru_subscn_included -->
        <var-decl name='fru_subscn_included' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char rtas_fru_scn::priority -->
        <var-decl name='priority' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- uint32_t rtas_fru_scn::loc_code_length -->
        <var-decl name='loc_code_length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- char rtas_fru_scn::loc_code[80] -->
        <var-decl name='loc_code' type-id='aa5ff375' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- rtas_fru_scn* rtas_fru_scn::next -->
        <var-decl name='next' type-id='81e42fbe' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <!-- rtas_fru_hdr* rtas_fru_scn::subscns -->
        <var-decl name='subscns' type-id='543d4fd8' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_fru_scn_raw -->
    <class-decl name='rtas_fru_scn_raw' size-in-bits='672' is-struct='yes' visibility='default' id='93ea2231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t rtas_fru_scn_raw::length -->
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <!-- uint32_t rtas_fru_scn_raw::data1 -->
        <var-decl name='data1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- char rtas_fru_scn_raw::priority -->
        <var-decl name='priority' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <!-- uint32_t rtas_fru_scn_raw::loc_code_length -->
        <var-decl name='loc_code_length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- char rtas_fru_scn_raw::loc_code[80] -->
        <var-decl name='loc_code' type-id='aa5ff375' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_src_scn -->
    <class-decl name='rtas_src_scn' size-in-bits='1056' is-struct='yes' visibility='default' id='d217e695'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_src_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- rtas_v6_hdr rtas_src_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='82350f5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_src_scn::version -->
        <var-decl name='version' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- char rtas_src_scn::src_platform_data[7] -->
        <var-decl name='src_platform_data' type-id='4e02d0a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint32_t rtas_src_scn::ext_refcode2 -->
        <var-decl name='ext_refcode2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- uint32_t rtas_src_scn::ext_refcode3 -->
        <var-decl name='ext_refcode3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- uint32_t rtas_src_scn::ext_refcode4 -->
        <var-decl name='ext_refcode4' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- uint32_t rtas_src_scn::ext_refcode5 -->
        <var-decl name='ext_refcode5' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- uint32_t rtas_src_scn::ext_refcode6 -->
        <var-decl name='ext_refcode6' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- uint32_t rtas_src_scn::ext_refcode7 -->
        <var-decl name='ext_refcode7' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- uint32_t rtas_src_scn::ext_refcode8 -->
        <var-decl name='ext_refcode8' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- uint32_t rtas_src_scn::ext_refcode9 -->
        <var-decl name='ext_refcode9' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- char rtas_src_scn::primary_refcode[36] -->
        <var-decl name='primary_refcode' type-id='16e6f2c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <!-- uint32_t rtas_src_scn::subscn_id -->
        <var-decl name='subscn_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- uint32_t rtas_src_scn::subscn_platform_data -->
        <var-decl name='subscn_platform_data' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <!-- uint32_t rtas_src_scn::subscn_length -->
        <var-decl name='subscn_length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- rtas_fru_scn* rtas_src_scn::fru_scns -->
        <var-decl name='fru_scns' type-id='81e42fbe' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- rtas_fru_hdr* -->
    <pointer-type-def type-id='f4fe811a' size-in-bits='32' id='543d4fd8'/>
    <!-- rtas_fru_scn* -->
    <pointer-type-def type-id='554c4658' size-in-bits='32' id='81e42fbe'/>
    <!-- rtas_fru_scn_raw* -->
    <pointer-type-def type-id='93ea2231' size-in-bits='32' id='b1a06dd9'/>
    <!-- rtas_src_scn* -->
    <pointer-type-def type-id='d217e695' size-in-bits='32' id='1141a0b5'/>
    <!-- void parse_fru_scn(rtas_event*, rtas_fru_scn*, rtas_fru_scn_raw*) -->
    <function-decl name='parse_fru_scn' mangled-name='parse_fru_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_fru_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- parameter of type 'rtas_fru_scn*' -->
      <parameter type-id='81e42fbe' name='fru'/>
      <!-- parameter of type 'rtas_fru_scn_raw*' -->
      <parameter type-id='b1a06dd9' name='rawfru'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- int parse_src_scn(rtas_event*) -->
    <function-decl name='parse_src_scn' mangled-name='parse_src_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_src_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_src_scn* rtas_get_src_scn(rtas_event*) -->
    <function-decl name='rtas_get_src_scn' mangled-name='rtas_get_src_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_src_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_src_scn* -->
      <return type-id='1141a0b5'/>
    </function-decl>
    <!-- int print_re_fru_scn(rtas_fru_scn*, int, int) -->
    <function-decl name='print_re_fru_scn' mangled-name='print_re_fru_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_fru_scn'>
      <!-- parameter of type 'rtas_fru_scn*' -->
      <parameter type-id='81e42fbe' name='fru'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='count'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int print_src_refcode(rtas_src_scn*) -->
    <function-decl name='print_src_refcode' mangled-name='print_src_refcode' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_src_refcode'>
      <!-- parameter of type 'rtas_src_scn*' -->
      <parameter type-id='1141a0b5' name='src'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int print_re_src_scn(scn_header*, int) -->
    <function-decl name='print_re_src_scn' mangled-name='print_re_src_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_src_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_v6_misc.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- char[9] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='72' id='4a11d4e4'>
      <!-- <anonymous range>[9] -->
      <subrange length='9' type-id='f0981eeb' id='12e4273c'/>
    </array-type-def>
    <!-- struct rtas_date_raw -->
    <class-decl name='rtas_date_raw' size-in-bits='32' is-struct='yes' visibility='default' id='7b1f33e5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t rtas_date_raw::year -->
        <var-decl name='year' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- uint32_t rtas_date_raw::month -->
        <var-decl name='month' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <!-- uint32_t rtas_date_raw::day -->
        <var-decl name='day' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_mt_scn -->
    <class-decl name='rtas_mt_scn' size-in-bits='384' is-struct='yes' visibility='default' id='135d6ad2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_mt_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- rtas_v6_hdr_raw rtas_mt_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='c554f330' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- rtas_mtms rtas_mt_scn::mtms -->
        <var-decl name='mtms' type-id='b89bc785' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_mtms -->
    <class-decl name='rtas_mtms' size-in-bits='176' is-struct='yes' visibility='default' id='b89bc785'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char rtas_mtms::model[9] -->
        <var-decl name='model' type-id='4a11d4e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <!-- char rtas_mtms::serial_no[13] -->
        <var-decl name='serial_no' type-id='f01347d9' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_priv_hdr_scn -->
    <class-decl name='rtas_priv_hdr_scn' size-in-bits='800' is-struct='yes' visibility='default' id='3d4fd243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_priv_hdr_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- rtas_v6_hdr rtas_priv_hdr_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='82350f5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- rtas_date rtas_priv_hdr_scn::date -->
        <var-decl name='date' type-id='74d9bf5c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- rtas_time rtas_priv_hdr_scn::time -->
        <var-decl name='time' type-id='595fd2c1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- char rtas_priv_hdr_scn::creator_id -->
        <var-decl name='creator_id' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- uint32_t rtas_priv_hdr_scn::scn_count -->
        <var-decl name='scn_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- uint32_t rtas_priv_hdr_scn::creator_subid_hi -->
        <var-decl name='creator_subid_hi' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- uint32_t rtas_priv_hdr_scn::creator_subid_lo -->
        <var-decl name='creator_subid_lo' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- uint32_t rtas_priv_hdr_scn::plid -->
        <var-decl name='plid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- uint32_t rtas_priv_hdr_scn::log_entry_id -->
        <var-decl name='log_entry_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- char rtas_priv_hdr_scn::creator_subid_name[9] -->
        <var-decl name='creator_subid_name' type-id='4a11d4e4' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_time_raw -->
    <class-decl name='rtas_time_raw' size-in-bits='32' is-struct='yes' visibility='default' id='feaaf4a4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- uint32_t rtas_time_raw::hour -->
        <var-decl name='hour' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <!-- uint32_t rtas_time_raw::minutes -->
        <var-decl name='minutes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- uint32_t rtas_time_raw::seconds -->
        <var-decl name='seconds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <!-- uint32_t rtas_time_raw::hundredths -->
        <var-decl name='hundredths' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct rtas_usr_hdr_scn -->
    <class-decl name='rtas_usr_hdr_scn' size-in-bits='448' is-struct='yes' visibility='default' id='4ad655e4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_usr_hdr_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- rtas_v6_hdr rtas_usr_hdr_scn::v6hdr -->
        <var-decl name='v6hdr' type-id='82350f5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- uint32_t rtas_usr_hdr_scn::subsystem_id -->
        <var-decl name='subsystem_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- uint32_t rtas_usr_hdr_scn::event_data -->
        <var-decl name='event_data' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- uint32_t rtas_usr_hdr_scn::event_severity -->
        <var-decl name='event_severity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- uint32_t rtas_usr_hdr_scn::event_type -->
        <var-decl name='event_type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- uint32_t rtas_usr_hdr_scn::action -->
        <var-decl name='action' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- rtas_date* -->
    <pointer-type-def type-id='74d9bf5c' size-in-bits='32' id='d8530dba'/>
    <!-- rtas_mt_scn* -->
    <pointer-type-def type-id='135d6ad2' size-in-bits='32' id='c79bb830'/>
    <!-- rtas_mtms* -->
    <pointer-type-def type-id='b89bc785' size-in-bits='32' id='6def01d5'/>
    <!-- rtas_priv_hdr_scn* -->
    <pointer-type-def type-id='3d4fd243' size-in-bits='32' id='314e07b3'/>
    <!-- rtas_time* -->
    <pointer-type-def type-id='595fd2c1' size-in-bits='32' id='2cb29249'/>
    <!-- rtas_usr_hdr_scn* -->
    <pointer-type-def type-id='4ad655e4' size-in-bits='32' id='8feb03b2'/>
    <!-- rtas_v6_hdr* -->
    <pointer-type-def type-id='82350f5d' size-in-bits='32' id='b1b6efed'/>
    <!-- void parse_rtas_date(rtas_date*, rtas_date_raw) -->
    <function-decl name='parse_rtas_date' mangled-name='parse_rtas_date' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_rtas_date'>
      <!-- parameter of type 'rtas_date*' -->
      <parameter type-id='d8530dba' name='rtas_date'/>
      <!-- parameter of type 'struct rtas_date_raw' -->
      <parameter type-id='7b1f33e5' name='rawdate'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void parse_rtas_time(rtas_time*, rtas_time_raw) -->
    <function-decl name='parse_rtas_time' mangled-name='parse_rtas_time' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_rtas_time'>
      <!-- parameter of type 'rtas_time*' -->
      <parameter type-id='2cb29249' name='rtas_time'/>
      <!-- parameter of type 'struct rtas_time_raw' -->
      <parameter type-id='feaaf4a4' name='rawtime'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void parse_v6_hdr(rtas_v6_hdr*, rtas_v6_hdr_raw*) -->
    <function-decl name='parse_v6_hdr' mangled-name='parse_v6_hdr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_v6_hdr'>
      <!-- parameter of type 'rtas_v6_hdr*' -->
      <parameter type-id='b1b6efed' name='v6hdr'/>
      <!-- parameter of type 'rtas_v6_hdr_raw*' -->
      <parameter type-id='0356b156' name='rawv6'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- int print_v6_hdr(char*, rtas_v6_hdr*, int) -->
    <function-decl name='print_v6_hdr' mangled-name='print_v6_hdr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_v6_hdr'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95' name='name'/>
      <!-- parameter of type 'rtas_v6_hdr*' -->
      <parameter type-id='b1b6efed' name='v6hdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int parse_priv_hdr_scn(rtas_event*) -->
    <function-decl name='parse_priv_hdr_scn' mangled-name='parse_priv_hdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_priv_hdr_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_priv_hdr_scn* rtas_get_priv_hdr_scn(rtas_event*) -->
    <function-decl name='rtas_get_priv_hdr_scn' mangled-name='rtas_get_priv_hdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_priv_hdr_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_priv_hdr_scn* -->
      <return type-id='314e07b3'/>
    </function-decl>
    <!-- int print_re_priv_hdr_scn(scn_header*, int) -->
    <function-decl name='print_re_priv_hdr_scn' mangled-name='print_re_priv_hdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_priv_hdr_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int parse_usr_hdr_scn(rtas_event*) -->
    <function-decl name='parse_usr_hdr_scn' mangled-name='parse_usr_hdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_usr_hdr_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_usr_hdr_scn* rtas_get_usr_hdr_scn(rtas_event*) -->
    <function-decl name='rtas_get_usr_hdr_scn' mangled-name='rtas_get_usr_hdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_usr_hdr_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_usr_hdr_scn* -->
      <return type-id='8feb03b2'/>
    </function-decl>
    <!-- int print_usr_hdr_subsystem_id(rtas_usr_hdr_scn*) -->
    <function-decl name='print_usr_hdr_subsystem_id' mangled-name='print_usr_hdr_subsystem_id' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_usr_hdr_subsystem_id'>
      <!-- parameter of type 'rtas_usr_hdr_scn*' -->
      <parameter type-id='8feb03b2' name='usrhdr'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int print_usr_hdr_event_data(rtas_usr_hdr_scn*) -->
    <function-decl name='print_usr_hdr_event_data' mangled-name='print_usr_hdr_event_data' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_usr_hdr_event_data'>
      <!-- parameter of type 'rtas_usr_hdr_scn*' -->
      <parameter type-id='8feb03b2' name='usrhdr'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int print_usr_hdr_action(rtas_usr_hdr_scn*) -->
    <function-decl name='print_usr_hdr_action' mangled-name='print_usr_hdr_action' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_usr_hdr_action'>
      <!-- parameter of type 'rtas_usr_hdr_scn*' -->
      <parameter type-id='8feb03b2' name='usrhdr'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int print_re_usr_hdr_scn(scn_header*, int) -->
    <function-decl name='print_re_usr_hdr_scn' mangled-name='print_re_usr_hdr_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_usr_hdr_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void parse_mtms(rtas_event*, rtas_mtms*) -->
    <function-decl name='parse_mtms' mangled-name='parse_mtms' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_mtms'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- parameter of type 'rtas_mtms*' -->
      <parameter type-id='6def01d5' name='mtms'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- int print_mtms(rtas_mtms*) -->
    <function-decl name='print_mtms' mangled-name='print_mtms' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_mtms'>
      <!-- parameter of type 'rtas_mtms*' -->
      <parameter type-id='6def01d5' name='mtms'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int parse_mt_scn(rtas_event*) -->
    <function-decl name='parse_mt_scn' mangled-name='parse_mt_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_mt_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_mt_scn* rtas_get_mt_scn(rtas_event*) -->
    <function-decl name='rtas_get_mt_scn' mangled-name='rtas_get_mt_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_mt_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_mt_scn* -->
      <return type-id='c79bb830'/>
    </function-decl>
    <!-- int print_re_mt_scn(scn_header*, int) -->
    <function-decl name='print_re_mt_scn' mangled-name='print_re_mt_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_mt_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int parse_generic_v6_scn(rtas_event*) -->
    <function-decl name='parse_generic_v6_scn' mangled-name='parse_generic_v6_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_generic_v6_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int print_re_generic_scn(scn_header*, int) -->
    <function-decl name='print_re_generic_scn' mangled-name='print_re_generic_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_generic_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='32' path='librtasevent_src/rtas_vend.c' comp-dir-path='/source' language='LANG_C99'>
    <!-- struct rtas_ibm_diag_scn -->
    <class-decl name='rtas_ibm_diag_scn' size-in-bits='160' is-struct='yes' visibility='default' id='2b2b6dd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- scn_header rtas_ibm_diag_scn::shdr -->
        <var-decl name='shdr' type-id='2fb651a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- uint32_t rtas_ibm_diag_scn::event_id -->
        <var-decl name='event_id' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- rtas_ibm_diag_scn* -->
    <pointer-type-def type-id='2b2b6dd3' size-in-bits='32' id='9ed70f13'/>
    <!-- rtas_vend_errlog_scn* -->
    <pointer-type-def type-id='f499a668' size-in-bits='32' id='3369d40e'/>
    <!-- struct rtas_vend_errlog_scn -->
    <class-decl name='rtas_vend_errlog_scn' is-struct='yes' visibility='default' is-declaration-only='yes' id='f499a668'/>
    <!-- int parse_ibm_diag_scn(rtas_event*) -->
    <function-decl name='parse_ibm_diag_scn' mangled-name='parse_ibm_diag_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_ibm_diag_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_ibm_diag_scn* rtas_get_ibm_diag_scn(rtas_event*) -->
    <function-decl name='rtas_get_ibm_diag_scn' mangled-name='rtas_get_ibm_diag_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_ibm_diag_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_ibm_diag_scn* -->
      <return type-id='9ed70f13'/>
    </function-decl>
    <!-- int print_re_ibm_diag_scn(scn_header*, int) -->
    <function-decl name='print_re_ibm_diag_scn' mangled-name='print_re_ibm_diag_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_ibm_diag_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int parse_vend_errlog_scn(rtas_event*) -->
    <function-decl name='parse_vend_errlog_scn' mangled-name='parse_vend_errlog_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='parse_vend_errlog_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- rtas_vend_errlog_scn* rtas_get_vend_errlog_scn(rtas_event*) -->
    <function-decl name='rtas_get_vend_errlog_scn' mangled-name='rtas_get_vend_errlog_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rtas_get_vend_errlog_scn'>
      <!-- parameter of type 'rtas_event*' -->
      <parameter type-id='699f2166' name='re'/>
      <!-- rtas_vend_errlog_scn* -->
      <return type-id='3369d40e'/>
    </function-decl>
    <!-- int print_re_vend_errlog_scn(scn_header*, int) -->
    <function-decl name='print_re_vend_errlog_scn' mangled-name='print_re_vend_errlog_scn' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='print_re_vend_errlog_scn'>
      <!-- parameter of type 'scn_header*' -->
      <parameter type-id='32e15bc5' name='shdr'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='verbosity'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
